{
  "documentTitle": "Vladimír Jančár - Interactive CV",
  "sectionTitles": {
    "contact": "Contact Information",
    "skills": "Core Competencies",
    "education": "Educational Background",
    "aboutMe": "About Me",
    "experience": "Professional Experience",
    "achievements": "Key Achievements"
  },
  "headerName": "VLADIMÍR JANČÁR",
  "headerTagline": "I CAN SOLVE RUBIK'S CUBE BLINDFOLDED",
  "contact": {
    "phone": "+421 903 979 659",
    "emailHref": "mailto:jvladko@gmail.com",
    "emailText": "jvladko@gmail.com",
    "addressLines": ["Družstevná 503/10", "072 22 Strážske", "Košice region"]
  },
  "skills": [
    {
      "id": "skillProg",
      "summary": "Programming",
      "popupTitle": "Programming Experience",
      "popupDetailsText": "I have been programming since my freshman year in high school. My journey started with Python, and I quickly expanded to C++ for competitive programming. During the lockdown, I delved into web development with JavaScript, TypeScript, HTML, and CSS. In college, I've furthered my skills in Java and Go.\n\nYou can find some of my recent projects on my GitHub: link:www.github.com/Vl4dk0."
    },
    {
      "id": "skillMath",
      "summary": "Mathematics",
      "popupTitle": "Mathematical Background",
      "popupDetailsText": "Mathematics has always been a strong suit and a passion. I've consistently performed well in mathematical competitions and believe it provides a crucial foundation for logical thinking and problem-solving in computer science."
    },
    {
      "id": "skillEng",
      "summary": "English Language (B2)",
      "popupTitle": "English Proficiency",
      "popupDetailsText": "I studied English in school from the 2nd grade of primary school. I successfully completed my maturity exams (Maturita) with a result in the >85th percentile, achieving a B2 level of proficiency according to the CEFR."
    }
  ],
  "education": [
    {
      "id": "edu0",
      "institution": "Primary School Strážske",
      "details": [],
      "dates": "2010 - 2019",
      "popupTitle": "Primary School Strážske",
      "popupDetailsText": "Attended primary school in Strážske, where I developed foundational academic skills and first discovered my interest in logical puzzles and problem-solving."
    },
    {
      "id": "edu1",
      "institution": "Gymnasium P. Horova, Michalovce",
      "details": ["Focus on Mathematics and Informatics"],
      "dates": "2019 - 2023",
      "popupTitle": "Gymnasium P. Horova",
      "popupDetailsText": "During my time at Gymnasium P. Horova, I specialized in subjects that deepened my understanding of mathematics and informatics. This period was crucial for participating in various Olympiads and competitions, solidifying my passion for programming."
    },
    {
      "id": "edu2",
      "institution": "Comenius University, Bratislava",
      "details": [
        "Faculty of Mathematics, Physics and Informatics",
        "Applied Informatics"
      ],
      "dates": "2023 - present",
      "popupTitle": "Comenius University - Applied Informatics",
      "popupDetailsText": "Currently pursuing a degree in Applied Informatics, where I am expanding my knowledge in various areas of computer science, including software development, algorithms, and data structures. I am actively engaging in challenging coursework and projects."
    }
  ],
  "aboutMe": [
    "Highly motivated and adaptable informatics student with a strong foundation in programming and problem-solving, honed through years of competitive mathematics and informatics.",
    "Seeking a challenging part-time or internship opportunity where I can contribute to innovative projects, further develop my technical skills, and learn from experienced professionals. Particularly interested in [mention specific areas like web development, backend systems, data science, etc. if you have preferences]."
  ],
  "experience": [
    {
      "id": "exp1",
      "summary": "SmartBase s.r.o, Junior, django - fullstack, 2024-2025",
      "popupTitle": "SmartBase s.r.o - Junior Developer",
      "popupDetailsText": "In SmartBase s.r.o I worked as a Junior developer on various projects s.a. <some websites>.\n\nAt first I only worked on frontend, html, css and javascript related tasks. But after first month I got to work on various tasks on backend as well. i.e. I worked on tasks s.a. integrating payment API or fixing bug with loading very high quality pictures when not necessary over mobile data.\n\nI learned a lot and they were quite nice to me. But I unfortunately didn't have time to work enough hours because of school."
    },
    {
      "id": "exp2",
      "summary": "Azteka, Pizza delivery, part-time, Summer 2020",
      "popupTitle": "Azteka - Pizza Delivery",
      "popupDetailsText": "During the summer of 2020, I worked part-time at Azteka delivering pizzas.\n\nThis role helped me develop time management and customer service skills. It was a great way to understand local businesses and interact with a diverse range of people."
    }
  ],
  "achievements": {
    "introText": "Since the 5th grade of primary school I have regularly placed in the top positions in various mathematical competitions. Thanks to a good foundation in mathematics, I learned to program and solve algorithmic problems very quickly and easily, which is why I started to compete in programming as well.",
    "subsections": [
      {
        "id": "achieveSub1",
        "title": "My greatest accomplishments in high school:",
        "items": [
          {
            "id": "achieveHS1",
            "summary": "Qualifying for the national round of Math Olympiad",
            "popupTitle": "Math Olympiad National Round",
            "popupDetailsText": "Qualifying for the national round of the Math Olympiad was a significant personal achievement. It involved months of preparation, tackling complex problems, and it was an honor to compete at that level. This experience greatly sharpened my analytical and problem-solving abilities."
          },
          {
            "id": "achieveHS2",
            "summary": "Obtaining 172 points at the KSP seminar (top 10 of 150+)",
            "popupTitle": "KSP Programming Seminar",
            "popupDetailsText": "KSP (Korešpondenčný Seminár z Programovania) is a prestigious programming correspondence seminar. Securing a top 10 position among over 150 participants was a result of consistent effort in solving algorithmic challenges and coding solutions, primarily in C++."
          }
        ]
      },
      {
        "id": "achieveSub2",
        "title": "Interesting achievements at university:",
        "items": [
          {
            "id": "achieveUni1",
            "summary": "1.05 grade point average (Where 1.0 is best)",
            "popupTitle": "Academic Excellence at University",
            "popupDetailsText": "Maintaining a 1.05 GPA in my initial semesters reflects my dedication to my studies and my ability to grasp complex concepts in informatics and mathematics quickly. (Note: In Slovakia, 1.0 is the best possible grade)."
          }
        ]
      }
    ]
  }
}
