{
  "documentTitle": "Vladimír Jančár",
  "sectionTitles": {
    "contact": "Kontakt",
    "skills": "Skills",
    "education": "Vzdelanie",
    "aboutMe": "O mne",
    "experience": "Pracovné skúsenosti",
    "achievements": "Úspechy",
    "projects": "Zaujímavé projekty"
  },
  "headerName": "VLADIMÍR JANČÁR",
  "headerTagline": "Viem poskladať rubikovú kocku naslepo",
  "hintText": "bold:(Tip:) Mnohé položky v tomto životopise sú interaktívne! Kliknite na ne a dozvite sa viac.",
  "languageHintText": "bold:(Hint:) You can change the CV language by clicking the button in the top right corner.",
  "contact": {
    "phone": "+421 903 979 659",
    "emailHref": "mailto:jvladko@gmail.com",
    "emailText": "jvladko@gmail.com",
    "addressLines": ["Družstevná 503/10", "Strážske (072 22)", "Košice region"]
  },
  "skills": [
    {
      "id": "skillProg",
      "summary": "Programovanie",
      "popupTitle": "Skúsenosti s programovaním",
      "popupDetailsText": "Programovať som začal v prvom ročníku na strednej škole, a to vďaka účasti na bold:(súťaži Zenit). Začal som s bold:(Pythonom), potom som rýchlo prešiel na bold:(C++) kvôli jeho rýchlosti, ktorá bola nevyhnutná pre súťaže. Vrátane bold:(Informatickej olympiády) (dvakrát som bol úspešným riešiteľom v krajskom kole, v oboch prípadoch len kúsok od postupu na bold:(celoštátne kolo)). Súťažením som si zdokonalil zručnosti v bold:(optimalizácii), bold:(teórii grafov), a všeobecne v bold:(logickom myslení). Hral som sa aj s bold:(LeetCode)-om.\n\nNa vysokej škole som si rozšíril svoje 'portfólio' o bold:(Javu), bold:(Go) (konkurencia), bold:(Haskell) (funkcionálne programovanie), bold:(C) (systémové programovanie), bold:(CL) (špecifikačno-verifikačná paradigma, špecialita na univerzite) a webové technológie (bold:(HTML), bold:(CSS), bold:(JS), bold:(PHP)). Tieto zručnosti som aplikoval pri riešení rozmanitých problémov, od súťažných algoritmov až po praktické automatizačné skripty v Exceli alebo iných tooliek/pomôcok, ktoré mi uľahčujú alebo zlepšujú život."
    },
    {
      "id": "skillMath",
      "summary": "Matematika",
      "popupTitle": "Matematický background",
      "popupDetailsText": "Matematiku som si obľúbil asi v piatom ročníku vďaka bold:(Matematickej olympiáde). Odvtedy som sa aktívne zúčastňoval na najznámejších matematických súťažiach (bold:(Matematická olympiáda), bold:(Klokan), bold:(Náboj), atď). Už od siedmeho ročníka na základnej škole som si často samostatne študoval bold:(pokročilé témy), dokonca aj tie, ktoré sa preberali až na vysokej škole. Matematike sa venujem vo svojom voľnom čase dodnes. V poslednom čase ma obzvlášť zaujíma bold:(Teória hier), bold:(Teória pravdepodobnosti) a bold:(Teória grafov)."
    },
    {
      "id": "skillAlgo",
      "summary": "Algoritmické myslenie",
      "popupTitle": "Algoritmické myslenie",
      "popupDetailsText": "Skúsenosti zo súťažného programovania (bold:(Matematická olympiáda), bold:(Informatická olympiáda), bold:(KSP), atď.) mi poskytli rozsiahlu prax v navrhovaní a implementácii bold:(efektívnych algoritmov, dátových štruktúr či stratégií). Nemám problém s oblasťami ako bold:(optimalizácia), bold:(teória grafov), bold:(teória pravdepodobnosti), bold:(geometria), bold:(dynamické programovanie) a v podstate s akoukoľvek inou bežnou technikou riešenia problémov ako binárne vyhľadávanie, backtracking, greedy, ..."
    },
    {
      "id": "skillLearn",
      "summary": "Učím sa veľmi rýchlo",
      "popupTitle": "Rýchle učenie a adaptabilita",
      "popupDetailsText": "Od mala súťažím (matematika, dejepis, chémia, geografia) a preto som sa musel učiť a vedieť rýchlo porozumieť novým programovacím jazykom (od bold:(Pythonu) po bold:(C++) kvôli rýchlosti v súťažiach, následne učenie sa bold:(Javy), bold:(Go), bold:(Haskellu) atď. na univerzite, a bold:(Djanga), bold:(CSS), bold:(JavaScriptu) atď. v práci). To demonštruje moju schopnosť bold:(rýchlo sa učiť nové koncepty a nástroje). Rád sa učím nové veci."
    },
    {
      "id": "skillResilience",
      "summary": "Odolnosť a vytrvalosť",
      "popupTitle": "Odolnosť a vytrvalosť",
      "popupDetailsText": "Moje skúsenosti s náročnými matematickými a programátorskými seminármi podobnými bold:(KSP), kde som venoval značné úsilie (niekedy na úkor spánku a jedla) riešeniu zložitých problémov a nakoniec dosiahol (bold:(dvakrát po sebe umiestnenie v top 10 v KSP)), ma naučili hodnote vytrvalosti. Zistil som, že mojou najsilnejšou stránkou nie je talent; ale to, že sa nevzdávam a dotiahnem veci do konca. Toto odhodlanie viedlo k môjmu prijatiu na bold:(Matfyz) s bold:(motivačným štipendiom).\n\nSúťažil som aj v KMS či STROMe, kde som bol tiež úspešný (okolo 30. – 50. miesta), ale nebol to až taký veľký úspech ako v KSP."
    },
    {
      "id": "skillAutomation",
      "summary": "Automatizácia",
      "popupTitle": "Automatizácia",
      "popupDetailsText": "Baví ma hľadať príležitosti na automatizáciu.\n\nNapríklad som pre rodinného príslušníka, účtovníka, vyvinul bold:(TypeScript skripty) na automatizáciu repetetívnych a vyčerpávajúcich úloh kontroly a sumarizácie dát v Exceli, bold:(čím som mu ušetril značné množstvo času).\n\nAlebo som si vytvoril nástroje, ktoré mi pomohli ušetriť čas pri domácich úlohách. Najzaujímaveší bol asi program, ktorý parsoval online editor (vytvorený našimi učiteľmi) do textového súboru, integroval nástroje, ktoré v priebehu sekúnd našli uzavreté tablá a formalizácie, a následne to automaticky reparsoval späť do požadovaného formátu online editora, pripravené na odovzdanie. Ušetril som tak približne pol hodinu za každé tablo, ktoré som nemusel riešiť ručne.\n\nTo dokazuje moju schopnosť aplikovať programátorské zručnosti na bold:(efektívne riešenie problémov z reálneho sveta)."
    },
    {
      "id": "skillHumor",
      "summary": "Humor",
      "popupTitle": "Zmysel pre humor",
      "popupDetailsText": "Ocením asi každý druh humoru a je pre mňa takmer nemožné, aby ma nejaký vtip urazil. Verím, že to prispieva k bold:(pozitívnej tímovej atmosfére). Avšak, tiež chápem význam kontextu a viem, kedy byť seriózny a kedy sa smiať."
    },
    {
      "id": "skillEng",
      "summary": "English Language (B2)",
      "popupTitle": "English Language",
      "popupDetailsText": "Angličtinu som sa v škole učil od druhého ročníka základnej školy. Úspešne som zložil maturitnú skúšku (bold:(Maturita)) s výsledkom niekde medzi bold:(top 15% maturantov) (>85. percentil). Moja úroveň bola bold:(B2) podľa SERR (Spoločného európskeho referenčného rámca)."
    },
    {
      "id": "skillRus",
      "summary": "Русский язык (B1)",
      "popupTitle": "Русский язык",
      "popupDetailsText": "Ruštinu som sa v škole učil od piateho ročníka základnej školy. Pokračoval som v jej štúdiu aj na strednej škole, kde som dosiahol úroveň bold:(B1) podľa SERR. Hoci som to nečakal, ukázalo sa to ako veľmi praktické, keďže je pre mňa jednoduchšie komunikovať s mojimi ukrajinskými spolužiakmi."
    }
  ],
  "education": [
    {
      "id": "edu0",
      "institution": "Základná škola Strážske",
      "details": ["Najlepšie známky"],
      "dates": "2010 - 2019",
      "popupTitle": "Základná škola Strážske",
      "popupDetailsText": "Počas Základnej školy som neustále dosahoval bold:(vynikajúce výsledky). Práve tu, obzvlášť od piateho ročníka, som objavil svoj záujem a nadanie na matematiku. Bolo to vďaka mojej účasti na bold:(Matematickej olympiáde). V tomto období som taktiež začal hrať volejbal, kde náš tím dosiahol celoštátne úspechy, vrátane bold:(3. miesta na Majstrovstvách Slovenska U15)."
    },
    {
      "id": "edu1",
      "institution": "Gymnázium P. Horova, Michalovce",
      "details": [
        "V triede so zameraním na matematiku a informatiku",
        "Najlepšie známky"
      ],
      "dates": "2019 - 2023",
      "popupTitle": "Gymnázium P. Horova, Michalovce - Začiatok s programovaním",
      "popupDetailsText": "Na Gymnáziu som naďalej akademicky vynikal, bold:(udržiaval som si najlepšie známky). Práve tu som sa začal venovať programovaniu, do veľkej miery vďaka účasti na bold:(súťaži Zenit). Uvedomil som si, že programovanie je bold:('ako matematika, ale lepšie,'). Najprv som začal s bold:(Pythonom) a neskôr som prešiel na bold:(C++). Počas celej strednej školy som tiež pokračoval v hraní volejbalu. Toto obdobie bolo kľúčové pre rozvoj mojich zručností v riešení problémov prostredníctvom rôznych olympiád a iných súťaží alebo projektov."
    },
    {
      "id": "edu2",
      "institution": "Univerzita Komenského, Bratislava",
      "details": [
        "Matfyz (Fakulta Matematiky, Fyziky a Informatiky)",
        "Aplikovaná informatika"
      ],
      "dates": "2023 - súčasnosť",
      "popupTitle": "Matfyz - Aplikovaná informatika",
      "popupDetailsText": "Na bold:(Matfyze) študujem program Aplikovaná informatika a za posledné dva roky si udržiavam bold:(vážený študijný priemer okolo 1,04). Náročný študijný plán ma 'núti' neustále sa učiť a riešiť komplexné problémy. Získal som praktické skúsenosti s webovým vývojom (bold:(HTML), bold:(CSS), bold:(JS), bold:(PHP)), konkurenciou (bold:(Go)), funkcionálnym programovaním (bold:(Haskell)), špecifikáciou a verifikáciou (bold:(CL)), systémovým programovaním (bold:(C)) a ďalej som si zdokonalil zručnosti v riešení problémov v jazykoch bold:(Python), bold:(Java) a bold:(C++).\n\nTáto škola ma tiež veľa naučila o bold:(pokročilej teórii pravdepodobnosti) a bold:(testovaní hypotéz). Umožnila mi využiť moje vedomosti z bold:(matematickej analýzy) a bold:(lineárnej algebry). V poslednom čase som sa naučil, ako bold:(písať formálne dôkazy), čo je oblasť, s ktorou som predtým zápasil."
    }
  ],
  "aboutMe": [
    "Dátum narodenia: 30.04.2004, Pohlavie: Muž, Národnosť: Slovenská",
    "bold:(Študent informatiky) so silnými základmi v matematike a riešení problémov, zdokonalenými rokmi súťaženia v matematike a informatike.",
    "Hľadám si brigádu alebo stáž, kde by som mohol prispieť k projektom, ďalej sa rozvíjať a učiť sa od profesionálov. Nehľadám konkrétny typ pozície. Som presvedčený, že by ma bavila akákoľvek rola zahŕňajúca programovanie a kritické myslenie, ako napríklad bold:(Web Development), bold:(Dátová veda), bold:(Umelá inteligencia), bold:(Vývoj hier), bold:(Automatizácia), bold:(aplikovaná Matematika), alebo kľudne aj bold:(Výskum/Veda). Preferujem prácu z kancelárie pred prácou z domu."
  ],
  "projects": [
    {
      "id": "proj1",
      "summary": "Graph Neural Networks - Rozšíriteľnosť čiastočného automorfizmu",
      "popupTitle": "GNNs - Moja téma na bakalársku prácu",
      "popupDetailsText": "Toto je moja bakalárska práca, na ktorej momentálne pracujem. Zahŕňa použitie bold:(grafových neurónových sietí) (GNN) na riešenie problému rozšíriteľnosti čiastočného automorfizmu. Cieľom je vyvinúť GNN model, ktorý dokáže bold:(predpovedať), či daný čiastočný automorfizmus môže byť bold:(rozšírený na úplný automorfizmus) pre daný graf a nejaký čiastočný automorfizmus. Tento projekt spája moje záujmy v bold:(teórii grafov) a bold:(strojovom učení). Pre tento problém bold:(neexistuje) žiaden dostupný bold:(dataset), takže som si ho musel bold:(vytvoriť) od základov sám. Šlo to v poriadku. Čo sa týka GNN a toho, či táto umelá inteligencia bude alebo nebude schopná predpovedať rozšíriteľnosť, si zatiaľ nie som istý. Stále som bold:(v procese trénovania) modelu a hodnotenia jeho výkonnosti."
    },
    {
      "id": "proj2",
      "summary": "Maturita vo vrecku - aplikácia, ktorá pomohla stovkám študentov pripraviť sa na maturitu zo Slovenčiny",
      "popupTitle": "Maturita vo vrecku - Projekt zo strednej školy",
      "popupDetailsText": "Na tomto projekte som pracoval v tíme na bold:(strednej škole). Bol to môj bold:(prvý tímový projekt). Prekvapil som sa v tom, že bold:(najťažšou) časťou bolo bold:(získať dáta) potrebné na vytvorenie aplikácie na štúdium. Vtedy ešte žiaden 'bold:(ChatGPT)' nebol :D. Čo sa týka vývoja, určite sa vyskytli aj mnohé komplikácie, ale tie tam boli hlavne preto, že sme boli začiatočníci."
    },
    {
      "id": "proj3",
      "summary": "Excel - Office skripty pre účtovníka, ktoré ušetrili hodiny práce.",
      "popupTitle": "Excel Automation - Office Scripts",
      "popupDetailsText": "Vytvoril som bold:(niekoľko) automatizačných skriptov v bold:(Exceli) pomocou Office Scripts pre môjho príbuzného, ktorý je bold:(skúseným účtovníkom). Tieto skripty automatizujú úlohy, ktoré si bold:(vyžadujú) veľa bold:(sústredenia) a bold:(výdrže), pričom bold:(nie sú) vôbec bold:(zaujímavé) (t.j. kontrola správnosti všetkých dát alebo vytváranie súhrnov). Skripty výrazne bold:(skracujú čas), ktorý týmto úloham musí venovať. Tento projekt zlepšil moje zručnosti v bold:(Exceli) a bold:(skriptovaní)."
    },
    {
      "id": "proj4",
      "summary": "Generátor vyvážených máp pre hru Catan",
      "popupTitle": "Catan Board Generator",
      "popupDetailsText": "Vždy, keď som vyhral partiu bold:(Catanu), musel som počúvať kamarátov: 'Herný plán bol bold:(nevyvážený)!', alebo 'To bolo čisté šťastie!'. Tak som sa rozhodol vytvoriť bold:(Generátor), ktorý generuje bold:(vyvážené) herné plány. Je to základný bold:(backtracking), ktorý generuje herné plány, až kým nenájde vyvážený na základe určitých bold:(pravidiel), ktoré sa snažím čo najoptimálnejšie kontrolovať. Používam to ako bold:(PWA) na svojom mobile.\n\nGithub: link:github.com/Vl4dk0/CatanBoardGenerator\n\nWebstránka: link:catanboardgen.netlify.app"
    },
    {
      "id": "proj5",
      "summary": "API pre hru PONG, ktoré umožňuje vytvárať Botov (AI), ktorí budú ovládať raketu",
      "popupTitle": "Projekt na hodinu informatiky na strednej škole",
      "popupDetailsText": "Na strednej škole som mal skvelú učiteľku, ktorá ma poprosila, aby som za ňu bold:(odučil dve hodiny), keď chýbala. Rozhodol som sa podľa jedného tutoriálu vytvoriť hru bold:(PONG) v Pythone a k nej som spravil bold:(API), aby si každý mohol naprogramovať bold:(Bota/AI), ktorý bude môcť ovládať raketku. Potom som na tom vysvetľoval tému bold:(tried) a bold:(dedičnosti). Nakoniec sme si v triede spravili bold:(turnaj) medzi našimi Botmi.\n\nGithub: link:github.com/Vl4dk0/pOnG"
    },
    {
      "id": "proj6",
      "summary": "Simulátor hodu mince v Unity na nájdenie 'férovej' mince",
      "popupTitle": "Simulovaný experiment pre Turnaj mladých fyzikov",
      "popupDetailsText": "Zúčastnil som sa bold:(Turnaja mladých fyzikov), kde jednou z úloh bolo nájsť 'férovú' mincu. To znamená, že pravdepodobnosť padnutia hlavy, znaku aj bold:(hrany) je rovnaká! Bol to projekt v bold:(Unity) a bold:(C#), ktorý mi pomohol overiť si moje výpočty. Tiež som vytvoril bold:(algoritmus), ktorý hľadal rozmery takéhoto valca. Fungoval dobre a výsledky boli veľmi bold:(blízke teórii), ktorá vyšla v pomere 1 ku √3 (1 pre výšku a √3 pre priemer valca). Toto bol môj jediný projekt v Unity a v C#, takže by som nepovedal, že ich ovládam, no C# mi pripadá podobný Jave.\n\nMimochodom, v ten deň sme bold:(vyhrali) 1. miesto v bold:(krajskom kole) (Košice)."
    }
  ],
  "experience": [
    {
      "id": "exp1",
      "summary": "Aztéka, Donáška pizze, Leto 2022",
      "popupTitle": "Aztéka - Donáška pizze",
      "popupDetailsText": "Hoci sa táto pozícia líši od tých, ktoré aktuálne hľadám, bola to moja bold:(prvá práca) a veľa som sa z nej o sebe naučil. Naučil som sa, ako bold:(komunikovať s frustrovanými zákazníkmi), ako bold:(pracovať v tíme) a ako si bold:(efektívne plánovať čas). Tiež som o sebe zistil, že dokážem dokončiť prácu, aj keď ma obzvlášť nebaví. bold:(Nezrútim sa pod tlakom)."
    },
    {
      "id": "exp2",
      "summary": "SmartBase s.r.o, Junior, Fullstack developer, 2024-2025",
      "popupTitle": "SmartBase s.r.o - Junior Django Fullstack developer",
      "popupDetailsText": "V spoločnosti SmartBase s.r.o (jún 2024 - apríl 2025) som pracoval ako bold:(Junior Fullstack Developer) na e-commerce projektoch ako link:alo.sk, link:argus.sk a link:najlekaren.sk. Spočiatku som sa zameriaval na frontendové úlohy (HTML, CSS, JavaScript podľa Figmy), no rýchlo ma priradili aj na backendové úlohy. Medzi najzaujímavejšie backendové úlohy patrili bold:(integrácia platobných API) a bold:(optimalizácia načítavania obrázkov) s cieľom znížiť spotrebu mobilných dát používateľov.\n\nVeľmi som si cenil túto vzdelávaciu skúsenosť a tímové prostredie. Rozišli sme sa v dobrom. Moje univerzitné povinnosti si vyžadovali viac času, a teda som sa pozícii nemohol naplno venovať."
    }
  ],
  "achievements": {
    "introText": "Od piateho ročníka základnej školy som sa pravidelne umiestňoval na bold:(popredných priečkach) v rôznych matematických súťažiach. Vďaka bold:(dobrým základom v matematike) som sa naučil bold:(programovať) a riešiť bold:(algoritmické problémy veľmi rýchlo a ľahko), preto som začal bold:(súťažiť aj v programovaní).",
    "subsections": [
      {
        "id": "achieveSub1",
        "title": "Najlepšie úspechy zo Strednej školy:",
        "items": [
          {
            "id": "achieveHS1",
            "summary": "Kvalifikácia na celoštátne kolo MO",
            "popupTitle": "Celoštátne kolo Matematickej olympiády",
            "popupDetailsText": "Kvalifikácia na bold:(celoštátne kolo Matematickej olympiády) bola pre mňa bold:(významným osobným úspechom). Táto skúsenosť výrazne zdokonalila moje analytické schopnosti a schopnosti riešiť problémy.\n\nHlavne som sa stretol s ostatnými ľuďmi, ktorých matematika baví rovnako ako mňa."
          },
          {
            "id": "achieveHS2",
            "summary": "Top 10 (of 150+) v KSP",
            "popupTitle": "Korešpondenčný Seminár z Programovania",
            "popupDetailsText": "bold:(Korešpondenčný Seminár z Programovania) bol pre mňa zlomovým bodom. Aby som sa kvalifikoval, venoval som obrovské úsilie riešeniu náročných problémov, často pracujúc aj celú noc. Dosiahnutie bold:(umiestnenia v top 10 dvakrát po sebe) nebolo len o šikovnosti; bolo to aj dôkazom mojej vytrvalosti. Za tento úspech som bol prijatý na bold:(Matfyz) s bold:(motivačným štipendiom). Teraz som hrdým členom tímu KSP, kde pomáham pripravovať úlohy na súťaže."
          },
          {
            "id": "achieveHSZenit",
            "summary": "2. miesto, Krajské Kolo Zenitu (10. miesto celoštátne)",
            "popupTitle": "Zenit v programovaní",
            "popupDetailsText": "Táto súťaž vo mne vzbudila záujem o súťažné programovanie. Bola to moja prvá programátorská súťaž. V poslednom ročníku strednej školy som dosiahol bold:(2. miesto v krajskom kole) súťaže Zenit v programovaní (Košický kraj), čo zároveň zodpovedalo bold:(10. miestu v celoštátnom meradle). Bol to pre mňa veľký úspech."
          },
          {
            "id": "achieveHSMaturitaMath",
            "summary": "top 5% Maturantov v matematike (v danom roku)",
            "popupTitle": "Maturita z matematiky",
            "popupDetailsText": "V písomnej časti bold:(Maturity) z matematiky som dosiahol výsledok, ktorý ma umiestňuje do viac ako bold:(96. percentilu).\n\nS výsledkom som však nebol úplne spokojný, keďže som mieril na 100% z testu a ušlo mi to o 3 body. Táto skúsenosť ma naučila dôležitosti dôkladnej kontroly, keďže všetky chyby vznikli z nesprávneho prepísania údajov zo zadania."
          },
          {
            "id": "achieveHSPythonCup",
            "summary": "Python Cup 1. miesto",
            "popupTitle": "Python Cup",
            "popupDetailsText": "Táto súťaž zahŕňala vytvorenie troch hier pomocou modulu Tkinter v Pythone. Bolo viac ako 40 víťazov, ktorí (z neznámych dôvodov) neboli zoradení podľa času odovzdania. Súťaž mala byť skôr zábavná než prestížna, ale na uznanie za víťaza bolo potrebné dosiahnuť bold:(100% skóre).\n\nCelkovo sa zúčastnilo stovky študentov z celého Slovenska."
          },
          {
            "id": "achieveHSPalmaStrom",
            "summary": "3. miesto na celoštátnom kole Palma-Strom",
            "popupTitle": "Palma-Strom celoštátne kolo",
            "popupDetailsText": "Išlo o súťaž v párovom programovaní, zameranú na riešenie štyroch náročných úloh v časovom limite štyroch hodín. Zúčastnil som sa jej s kamarátom a dosiahli sme bold:(3. miesto v celoštátnom kole), čo bol pre nás veľký úspech."
          }
        ]
      },
      {
        "id": "achieveSub2",
        "title": "Vysoká škola:",
        "items": [
          {
            "id": "achieveUni1",
            "summary": "Vážený študijný priemer 1.04 (za celé štúdium)",
            "popupTitle": "Na Matfyze",
            "popupDetailsText": "Môj bold:(vážený študijný priemer 1,04) odráža moju schopnosť rýchlo chápať komplexné koncepty."
          }
        ]
      },
      {
        "id": "achieveSubPersonal",
        "title": "Iné osobné úspechy:",
        "items": [
          {
            "id": "achieveVolleyball",
            "summary": "U15 Volejbal (3. miesto na Majstrovstvách Slovenska)",
            "popupTitle": "Volejbal",
            "popupDetailsText": "Aktívne hrám volejbal od piateho ročníka základnej školy a súťažil som na celoštátnej úrovni. Náš tím dosiahol bold:(3. miesto na Majstrovstvách Slovenska U15) v jednom roku a 6. miesto v nasledujúcom. Tento šport ma naučil cenné lekcie o bold:(tímovej práci), bold:(disciplíne), bold:(rešpekte) (najmä voči nášmu trénerovi) a udržiavaní aktívneho životného štýlu."
          }
        ]
      }
    ]
  }
}
